code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-17 Tue 09:28 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Chris Wallace: code</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="css/bigblowcustom.css"/>
<link rel="stylesheet" href="http://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css">
</head>
<body>
<div id="content">
<h1 class="title">Chris Wallace: code</h1>
<div id="nav">
<a class="navbar-link" href="index.html"><i class="fa fa-home"></i></a> |
<!-- <a href="./background.html">Background</a> |  -->
<a class="navbar-link" href="./group.html">Group</a> |
<a class="navbar-link" href="./research.html">Research</a> |
<a class="navbar-link" href="./data.html">Data</a> |
<a class="navbar-link" href="./code.html">Software</a> |
<!-- <a class="navbar-link" href="http://europepmc.org/search?query=AUTHORID:%220000-0001-9755-1703%22&sortby=Date">Publications</a> | -->
<a class="navbar-link" href="./pubs.html">Publications</a> |
<a class="navbar-link" href="./contact.html">Links and contact</a>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">CRAN packages</h2>
<div class="outline-text-2" id="text-orgheadline5">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><a href="http://cran.r-project.org/web/packages/coloc/index.html">coloc</a></h4>
<div class="outline-text-4" id="text-orgheadline1">
<p>
a package of R functions used to test for
colocalisation of two genetic traits.  For more detail or
the statistical background and applications see:
</p>

<blockquote>
<p>
Wallace et al. Statistical colocalisation of monoyte gene
          expression and genetic risk variants for type 1
          diabetes. <i>Hum Mol Genet</i> 2010. [ <a href="http://europepmc.org/abstract/MED/22403184">Europe PMC</a> ]
</p>
</blockquote>

<blockquote>
<p>
Wallace. Statistical testing of shared genetic control for potentially related traits. [ <a href="http://arxiv.org/abs/1301.5510">arXiv 1301.5510</a> ]
</p>
</blockquote>

<blockquote>
<p>

</p>

<p>
Giambartolomei et al.  Bayesian test for co-localisation between pairs of genetic association studies using summary statistics. [ <a href="http://arxiv.org/abs/1305.4022">arXiv 1305.4022</a> ]
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><a href="http://cran.r-project.org/web/packages/snpStatsWriter/index.html">snpStatsWriter</a></h4>
<div class="outline-text-4" id="text-orgheadline2">
<p>
allows writing snpStats objects to disk in formats suitable
for reading by snphap, phase, mach, IMPUTE, beagle, and
(almost) anything else that expects a rectangular format.
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><a href="http://cran.r-project.org/web/packages/wgsea/index.html">wgsea</a></h4>
<div class="outline-text-4" id="text-orgheadline3">
<p>
implements a
          Wilcoxon-based test for Gene Set Enrichment Analysis when
          testing regions of the genome according to GWAS derived
          evidence for SNP-trait association.  For more detail, see
          the supplementary methods of          
</p>
<blockquote>
<p>
 A trans-acting locus regulates an anti-viral expression network and type 1
diabetes risk.  Heinig M, et al.  <i>Nature</i> 2010. [ <a href="http://europepmc.org/abstract/MED/20827270">Europe PMC</a> ]
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><a href="http://cran.r-project.org/web/packages/extraBinomial">extraBinomial</a></h4>
<div class="outline-text-4" id="text-orgheadline4">
<p>
(author Xin Yang, listed here because Xin doesn't have her own website)
uses an extra binomial model to test for case-control
allele frequency differences in pooled sequence data.  See
</p>
<blockquote>
<p>
Yang X, Todd JA, Clayton D, and Wallace C.
Extra-binomial variation approach for analysis of pooled DNA sequencing data.
<i>Bioinformatics</i> 2012.
[ <a href="http://europepmc.org/abstract/MED/22976083">Europe PMC</a> ]
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Non-CRAN packages</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
To install these from github, do, in R:
</p>
<div class="org-src-container">

<pre class="src src-R">install.packages(<span style="font-style: italic;">"devtools"</span>)
<span style="font-weight: bold; text-decoration: underline;">library</span>(devtools)
install_github(<span style="font-style: italic;">"chr1swallace/package.name"</span>, <span style="font-style: italic;">"chr1swallace"</span>)
</pre>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><a href="https://github.com/chr1swallace/annotSnpStats">annotSnpStats</a></h4>
<div class="outline-text-4" id="text-orgheadline7">
<p>
extends SnpMatrix objects from the snpStats package by tying in
sample and snp annotation data.frames.  It allows the joint
manipulation, and binding, of such objects, and includes a few
functions I use for finding duplicate samples, applying QC, and
aligning alleles between different datasets.  It seems to work,
and I intend to push it to CRAN in the future.
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><a href="https://github.com/chr1swallace/GUESSFM">GUESSFM</a></h4>
<div class="outline-text-4" id="text-orgheadline8">
<p>
A wrapper around the GUESS stochastic model search method for fine
mapping causal variants in genetic data.   See <a href="research.html#MissingReference">more detail here</a>.
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><a href="https://github.com/chr1swallace/origin">origin</a></h4>
<div class="outline-text-4" id="text-orgheadline9">
<p>
implements an   extension to the Weinberg method for testing for parent of origin
  effects to allow for multiple affected offspring in a nuclear
  family.  I haven't used it in a while, and it requires some checking
  just to get it to pass the CRAN tests.  Unless I need to revisit it
  for another reason, I am unlikely to push it to CRAN, but it is a
  finished package.
  For more detail see:
</p>
<blockquote>
<p>
Weinberg et al. Methods for detection of parent-of-origin effects in
   genetic studies of case-parents triads. <i>Am J Hum Genet</i>
   65:229-235. 1999.
</p>
</blockquote>
<blockquote>
<p>
Wallace et al. The imprinted DLK1-MEG3 gene region on chromosome
14q32.2 alters susceptibility to type 1 diabetes. <i>Nat
  Genet</i> 2010.
[ <a href="http://europepmc.org/abstract/MED/19966805">Europe PMC</a> ]
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11">Older software</h2>
<div class="outline-text-2" id="text-orgheadline11">
</div><div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">IBDSCORE</h4>
<div class="outline-text-4" id="text-orgheadline10">
<p>
implements a score test for the Rice-Holmans IBD
        regression model.
        The model is described by
</p>

<blockquote>
<p>
Holmans, P. <i>Human Heredity</i> 2002. 53:92-102
</p>
</blockquote>
<blockquote>
<p>
Rice et al. <i>Genet Epidemiol</i> 1999. 17:S691-S695
</p>
</blockquote>
<p>
and this score test by
</p>
<blockquote>
<p>
Wallace et al. <i>Am J Hum Genet</i> 2006. 79:323-31 [ <a href="http://europepmc.org/abstract/MED/16826522">Europe PMC</a> ]
</p>
</blockquote>

<p>
[ <a href="http://www-gene.cimr.cam.ac.uk/staff/wallace/soft/ibdscore.tgz">download</a> ]
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">See also&#x2026;</h2>
<div class="outline-text-2" id="text-orgheadline12">
<p>
[ <a href="http://crantastic.org/authors/2111">published R packages on CRAN</a> | <a href="http://github.com/chr1swallace">all code at github</a> | <a href="http://cwcode.wordpress.com/">code blog</a> ]
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-17 Tue 09:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
